src/c01-reator-pistao/constant-properties/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       389980;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       390000;
    }
    front
    {
        type            wedge;
        physicalType    patch;
        nFaces          200000;
        startFace       390020;
    }
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          10000;
        startFace       590020;
    }
    back
    {
        type            wedge;
        physicalType    patch;
        nFaces          200000;
        startFace       600020;
    }
)

// ************************************************************************* //
