src/c01-reator-pistao/constant-properties/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// More info here:
// https://holzmann-cfd.com/community/blog-and-tools/cae-blog/
//     thermophysical-properties-water

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture                                                                        
{                                                                              
    specie                                                                     
    {                                                                          
        molWeight       18.0;                                                  
    }                                                                          
    thermodynamics                                                             
    {                                                                          
        Cp              4182;      
        Sf              0;                                                     
        Hf              0;                                                     
    }                                                                          
    equationOfState                                                            
    {                                                                          
        rho             1000;               
    }                                                                          
    transport                                                                  
    {                                                                          
        mu              0.001; 
        Pr              6.9;           
    }                                                                          
}


// ************************************************************************* //
