src/c01-reator-pistao/constant-properties/system/avgOutlets
// -*- C++ -*-

// Mandatory entries (unmodifiable)
type            surfaceFieldValue;
libs            (fieldFunctionObjects);

// Mandatory entries (runtime modifiable)
fields          ( p U T );
operation       weightedAverage;
regionType      patch;
name            outlet;

// Optional entries (runtime modifiable)
postOperation   none;
weightField     phi;
scaleFactor     1.0;
writeArea       false;
surfaceFormat   none;

// Optional (inherited) entries
writeFields     false;
scalingFactor   1.0;
writePrecision  8;
writeToFile     true;
useUserTime     true;
region          region0;
enabled         true;
log             true;
timeStart       0;
timeEnd         1000000;
executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;
writeInterval   1;